EDT/УТ/src/DataProcessors/новаВыгрузкаРейсовВWMS/новаВыгрузкаРейсовВWMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>новаВыгрузкаРейсовВWMS</name>
  <comment>Выгружаем подготовленные рейсы в формате XML В WMS</comment>
  <attributes>
    <name>ВыводитьЛог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьЛог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьИмяФайлаОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонВыгрузки</name>
    <comment>Формат(ТекущаяДата(),&quot;ДФ=&quot;&quot;ггггММдд_ЧЧммсс_&quot;&quot;&quot;)+&quot;DOSTAVKA_OUT_UTL&quot;.XML</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКвитанции</name>
    <comment>*CONFIRMATION_OUT_UTL.XLM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЛогФайла</name>
    <comment>Формат(ТекущаяДата(),&quot;ДФ=&quot;&quot;ггггММдд_ЧЧммсс_&quot;&quot;&quot;)+&quot;DOSTAVKA_OUT_UTL&quot;.Log</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/новаТочкиМаршрутаРейсов/новаТочкиМаршрутаРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаТочкиМаршрутаРейсов</name>
  <resources>
    <name>КодТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.новаДействияВТочкеРейсаМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаПосещения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПлановоеВремяПосещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановоеВремяПосещенияУказаноВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КодУчасткаТрекаКТочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодУчасткаТрекаОтТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасстояниеКТочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяКТочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОтТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическоеВремяПосещенияУказаноВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутСопровождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/новаЗаданияРейсов/новаЗаданияРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаЗаданияРейсов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.новаВидыЗаданийРейсаМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполненоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутСопровождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/новаСостоянияОбъектовДляОбмена/новаСостоянияОбъектовДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаСостоянияОбъектовДляОбмена</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.новаСостоянияОбъектовДляОбмена</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/новаДействияВТочкеРейсаМестнойДоставки/новаДействияВТочкеРейсаМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>новаДействияВТочкеРейсаМестнойДоставки</name>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Разгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаИРазгрузка</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/новаСостоянияОбъектовДляОбмена/новаСостоянияОбъектовДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>новаСостоянияОбъектовДляОбмена</name>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/новаЭтапыМестнойДоставки/новаЭтапыМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаЭтапыМестнойДоставки</name>
  <predefined>
    <items>
      <name>ЗавершениеМестнойДоставки</name>
      <description>Завершение местной доставки</description>
    </items>
    <items>
      <name>ЗавершениеПланирования</name>
      <description>Завершение планирования</description>
    </items>
    <items>
      <name>ОбработкаНедовозаМестнойДоставки</name>
      <description>Обработка недовоза местной доставки</description>
    </items>
    <items>
      <name>ПланированиеМестнойДоставки</name>
      <description>Планирование местной доставки</description>
    </items>
    <items>
      <name>ПодготовкаКВыездуМестнойДоставки</name>
      <description>Подготовка к выезду местной доставки</description>
    </items>
    <items>
      <name>СогласованиеМестнойДоставки</name>
      <description>Согласование местной доставки</description>
    </items>
    <items>
      <name>СогласованиеПланированияМестнойДоставки</name>
      <description>Согласование планирования местной доставки</description>
    </items>
    <items>
      <name>СопровождениеМестнойДоставки</name>
      <description>Сопровождение местной доставки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыполнятьЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/новаВыгрузкаРейсовВWMS/ObjectModule.bsl
Перем ФайлВыгрузки Экспорт;            // Последовательно записываемый/читаемый файл обмена
Перем Обмен Экспорт;
Перем СписокЗадач;

Процедура ВыгрузитьДанныеПоОбмену(_Обмен, _СписокЗадач = Неопределено,ПроверкаВыполненияЭтапа=Истина) Экспорт;
	
	Обмен 				= _Обмен;
	СписокЗадач			= _СписокЗадач;
	КаталогВыгрузки		= _Обмен.КаталогВыгрузки;
	КаталогВыгрузки 	= ПолучитьПутьКФайлам();
	ИмяФайлаВыгрузки    = "DELIVERY_"+Формат(ТекущаяДата(),"ДФ=""ггггММдд_ЧЧммсс_""")+"_OUT_UTL.xml";
	
	ВыгрузитьДанныеВWMS(ПроверкаВыполненияЭтапа);
	
КонецПРоцедуры

Процедура ВыгрузитьДанныеВWMS(ПроверкаВыполненияЭтапа) Экспорт;

	РегистраторыКонтекст	= Неопределено;
	РегистраторСобытий 		= Неопределено;
	
	РегистраторыКонтекст = Неопределено;
#Если Клиент Тогда	
	новаКонтекст.Свойство("РегистраторСобытий", РегистраторыКонтекст);
#Иначе	
	Если РегистраторыКонтекст = Неопределено Тогда
		РегистраторыКонтекст = Новый Соответствие;
	КонецЕсли;
#КонецЕсли
	
	РегистраторСобытий = РегистраторыКонтекст.Получить(Обмен.Код);
	Если РегистраторСобытий = Неопределено Тогда
		
		РегистраторСобытий = Обработки.новаРегистраторСобытий.Создать();
		РегистраторыКонтекст.Вставить(Обмен.Код, РегистраторСобытий);
	КонецЕсли;
	РегистраторСобытий.Заголовок = "Выполнение обмена данными по настройке: <"
									+ Обмен.Наименование+"> за период с : "
									+ ДатаНачВыгрузки + " по: " + ДатаКонВыгрузки;
	РегистраторСобытий.Сообщения.Очистить();
	
	РегистраторСобытий.Добавить(,,"Начало экспорта данных в WMS");
	
	ВыполнитьЭкспорт(РегистраторСобытий,ПроверкаВыполненияЭтапа);
	
	РегистраторСобытий.Добавить(,,"Завершение экспорта данных в WMS");
	
	//
	РегистраторСобытий.Добавить(,,"--- Обмен завершен");
	Если ЗаписыватьЛог Тогда
		РегистраторСобытий.ИмяРезультирующегоФайла = Обмен.КаталогВыгрузки + "\"+"log.mxl";
	Иначе
		РегистраторСобытий.ИмяРезультирующегоФайла = "";
	КонецЕсли;
	Если ВыводитьЛог Тогда
		РегистраторСобытий.ТихийРежим = Ложь;
	Иначе
		РегистраторСобытий.ТихийРежим = Истина;
	КонецЕсли;
	РегистраторСобытий.Вывести();	
	
КонецПРоцедуры

Процедура ВыполнитьЭкспорт(РегистраторСобытий,ПроверкаВыполненияЭтапа)
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(КаталогВыгрузки+ИмяФайлаВыгрузки, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Обмен");
		ЗаписьXML.ЗаписатьАтрибут("ИсточникВыгрузки", "УТЛ");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Документы"); 
		
    		ЗаписатьРейсы(ЗаписьXML, РегистраторСобытий,ПроверкаВыполненияЭтапа);
			
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Документы
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Обмен
	
	ЗаписьXML.Закрыть();
КонецПроцедуры

Функция ПолучитьПутьКФайлам()
	//Формируем строку пути к файлам
	стрПуть = КаталогВыгрузки;
	стрПуть = СтрЗаменить(стрПуть, "/", "\");
	Если Не (Прав(стрПуть, 1) = "\") Тогда
		стрПуть = стрПуть + "\";
	КонецЕсли;
	Возврат стрПуть;
КонецФункции

Функция ПроверитьСуществованиеКаталога(ИмяКаталога) Экспорт
    КаталогНаДиске = Новый Файл(ИмяКаталога);
    Если КаталогНаДиске.Существует() Тогда
        Возврат Истина;
    Иначе
#Если Клиент Тогда		
		Ответ = Вопрос("Каталог не существует. Создать?", 
                        РежимДиалогаВопрос.ОКОтмена);
        Если Ответ = КодВозвратаДиалога.ОК Тогда
            СоздатьКаталог(ИмяКаталога);
            Возврат Истина;
        Иначе
            Возврат Ложь;
		КонецЕсли;
#Иначе
     	СоздатьКаталог(ИмяКаталога);
        Возврат Истина;		
#КонецЕсли
    КонецЕсли;
КонецФункции

Функция ПолучитьРейсы(ПроверкаВыполненияЭтапа) Экспорт   	
	Запрос = Новый Запрос();
	
	Роль = Обмен.РольВыгрузки;
	Если Не ЗначениеЗаполнено(Роль) Тогда 
		Роль = Справочники.новаЭтапыМестнойДоставки.ПодготовкаКВыездуМестнойДоставки;
	КонецЕсли;	
	Если Роль = Справочники.новаЭтапыМестнойДоставки.ПланированиеМестнойДоставки Тогда
		 ПроверкаВыполненияЭтапа = Истина;
	КонецЕсли; 
    //ПроверкаВыполненияЭтапа;
	Если СписокЗадач = Неопределено Тогда
		стрТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                  |	Задачи.БизнесПроцесс.Номер КАК НомерРейса,
	                  |	Задачи.БизнесПроцесс.Дата КАК ДатаРейса,
	                  |	Задачи.БизнесПроцесс.ДатаНачала КАК ДатаНачалаРейса,
	                  |	Задачи.БизнесПроцесс.Транспорт КАК Транспорт,
	                  |	Задачи.БизнесПроцесс.Водитель КАК Водитель,
	                  |	Задачи.БизнесПроцесс.Экспедитор КАК Экспедитор,
	                  |	новаТочкиМаршрутаРейсов.НомерТочки + 1 НомерТочки,
	                  |	новаЗаданияРейсов.Доставка.Номер КАК НомерЗаказа,
	                  |	новаЗаданияРейсов.Доставка.Дата КАК ДатаЗаказа,
	                  |	новаЗаданияРейсов.Доставка.Вид КАК ВидОперации,
	                  |	новаТочкиМаршрутаРейсов.Действие,
	                  |	новаТочкиМаршрутаРейсов.ТочкаМаршрута.Адрес КАК АдресДоставки,
	                  |	новаЗаданияРейсов.Доставка.Грузополучатель КАК Грузополучатель,
	                  |	новаТочкиМаршрутаРейсов.НомерТочки + 1 КАК ПорядокПогрузкиВТС,
	                  |	новаСостоянияОбъектовДляОбмена.Состояние,
	                  |	Задачи.БизнесПроцесс.Ссылка КАК БизнесПроцессСсылка,
	                  |	новаЗаданияРейсов.Доставка.Ссылка КАК ДоставкаСсылка
	                  |ИЗ
	                  |	Задача.новаЗадачаРейсаМестнойДоставки.ЗадачиПоИсполнителю(
					  |			&Роль,
					  |			(Выполнена = &Выполнена)
					  //|				И (БизнесПроцесс.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКонец, ДЕНЬ))
					  |) КАК Задачи
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаТочкиМаршрутаРейсов КАК новаТочкиМаршрутаРейсов
	                  |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	                  |			ПО новаТочкиМаршрутаРейсов.КодТочки = новаЗаданияРейсов.КодТочки
	                  |				И новаТочкиМаршрутаРейсов.Рейс = новаЗаданияРейсов.Рейс
	                  |		ПО Задачи.БизнесПроцесс = новаТочкиМаршрутаРейсов.Рейс
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаСостоянияОбъектовДляОбмена КАК новаСостоянияОбъектовДляОбмена
	                  |		ПО Задачи.БизнесПроцесс.Ссылка = новаСостоянияОбъектовДляОбмена.Объект.Ссылка
	                  |ГДЕ
	                  |	новаТочкиМаршрутаРейсов.МаршрутСопровождения = ЛОЖЬ
	                  |	И (НЕ новаТочкиМаршрутаРейсов.Действие = ЗНАЧЕНИЕ(Перечисление.новаДействияВТочкеРейсаМестнойДоставки.Погрузка))
	                  |	И новаСостоянияОбъектовДляОбмена.Состояние = ЗНАЧЕНИЕ(Перечисление.новаСостоянияОбъектовДляОбмена.Подготовлен)
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	ДатаРейса,
	                  |	НомерТочки УБЫВ
	                  |ИТОГИ ПО
	                  |	БизнесПроцессСсылка";
					  
		//Запрос.УстановитьПараметр("ДатаНачала",ДатаНачВыгрузки);
		//Запрос.УстановитьПараметр("ДатаКонец",ДатаКонВыгрузки);
		Запрос.УстановитьПараметр("Роль", Роль);
					  
	Иначе
		стрТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                  |	Задачи.БизнесПроцесс.Номер КАК НомерРейса,
		                  |	Задачи.БизнесПроцесс.Дата КАК ДатаРейса,
		                  |	Задачи.БизнесПроцесс.ДатаНачала КАК ДатаНачалаРейса,
		                  |	Задачи.БизнесПроцесс.Транспорт КАК Транспорт,
		                  |	Задачи.БизнесПроцесс.Водитель КАК Водитель,
		                  |	Задачи.БизнесПроцесс.Экспедитор КАК Экспедитор,
		                  |	новаТочкиМаршрутаРейсов.НомерТочки + 1 КАК НомерТочки,
		                  |	новаЗаданияРейсов.Доставка.Номер КАК НомерЗаказа,
		                  |	новаЗаданияРейсов.Доставка.Дата КАК ДатаЗаказа,
		                  |	новаЗаданияРейсов.Доставка.Вид КАК ВидОперации,
		                  |	новаТочкиМаршрутаРейсов.Действие,
		                  |	новаТочкиМаршрутаРейсов.ТочкаМаршрута.Адрес КАК АдресДоставки,
		                  |	новаЗаданияРейсов.Доставка.Грузополучатель КАК Грузополучатель,
		                  |	новаТочкиМаршрутаРейсов.НомерТочки + 1 КАК ПорядокПогрузкиВТС,
		                  |	новаСостоянияОбъектовДляОбмена.Состояние,
		                  |	Задачи.БизнесПроцесс.Ссылка КАК БизнесПроцессСсылка,
		                  |	новаЗаданияРейсов.Доставка.Ссылка КАК ДоставкаСсылка
		                  |ИЗ
		                  |	Задача.новаЗадачаРейсаМестнойДоставки.ЗадачиПоИсполнителю(
		                  |			&Роль,
		                  |			Выполнена = &Выполнена
		                  |				И Ссылка В (&спЗадачи)) КАК Задачи
		                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаТочкиМаршрутаРейсов КАК новаТочкиМаршрутаРейсов
		                  |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
		                  |			ПО новаТочкиМаршрутаРейсов.КодТочки = новаЗаданияРейсов.КодТочки
		                  |				И новаТочкиМаршрутаРейсов.Рейс = новаЗаданияРейсов.Рейс
		                  |		ПО Задачи.БизнесПроцесс = новаТочкиМаршрутаРейсов.Рейс
		                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаСостоянияОбъектовДляОбмена КАК новаСостоянияОбъектовДляОбмена
		                  |		ПО Задачи.БизнесПроцесс.Ссылка = новаСостоянияОбъектовДляОбмена.Объект.Ссылка
		                  |ГДЕ
		                  |	новаТочкиМаршрутаРейсов.МаршрутСопровождения = ЛОЖЬ
		                  |	И (НЕ новаТочкиМаршрутаРейсов.Действие = ЗНАЧЕНИЕ(Перечисление.новаДействияВТочкеРейсаМестнойДоставки.Погрузка))
		                  |	И новаСостоянияОбъектовДляОбмена.Состояние = ЗНАЧЕНИЕ(Перечисление.новаСостоянияОбъектовДляОбмена.Подготовлен)
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	ДатаРейса,
		                  |	НомерТочки УБЫВ
		                  |ИТОГИ ПО
		                  |	БизнесПроцессСсылка";
					  
		спЗадачи = Новый СписокЗначений();			  
		Для Каждого ЭлЗадача Из СписокЗадач Цикл
			спЗадачи.Добавить(ЭлЗадача.Ключ);
		КонецЦикла;
					  
		Запрос.УстановитьПараметр("спЗадачи",спЗадачи);
		//Проверяем этап доставки  	Справочники.новаЭтапыМестнойДоставки.ЗавершениеМестнойДоставки
		//Этап = Справочники.новаЭтапыМестнойДоставки.ПустаяСсылка();
		//Выполнена = Ложь;
		//Для Каждого ЭлЗадача Из СписокЗадач Цикл
		//	Этап = ЭлЗадача.Ключ.Роль;
		//	Выполнена = ЭлЗадача.Ключ.Выполнена;
		//	Прервать;
		//КонецЦикла;

		//Запрос.УстановитьПараметр("Выполнена",Истина);//Выполнена);
		Запрос.УстановитьПараметр("Роль", Роль);
					  
	КонецЕсли;	
	Запрос.УстановитьПараметр("Выполнена",ПроверкаВыполненияЭтапа);//Выполнена);	
    Запрос.Текст = стрТекстЗапроса;

	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

//Процедура последовательно записывает рейсы в XML
Процедура ЗаписатьРейсы(ЗаписьXML, РегистраторСобытий = Неопределено, ПроверкаВыполненияЭтапа=Истина) Экспорт
	
	РезультатЗапроса = ПолучитьРейсы(ПроверкаВыполненияЭтапа);
	
	ВыборкаРейс = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ"); 
	ЗаписьXML.ЗаписатьНачалоАтрибута("ИмяДокумента");
	ЗаписьXML.ЗаписатьТекст("РейсМестнойДоставки");
	ЗаписьXML.ЗаписатьКонецАтрибута();
	ЗаписьXML.ЗаписатьНачалоАтрибута("Количество");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаРейс.Количество()));
	ЗаписьXML.ЗаписатьКонецАтрибута();

	Если ВыборкаРейс.Количество() = 0 Тогда
		новаОбмены.РегистрацияСобытия(РегистраторСобытий, СтатусСообщения.Информация, "Информация", "Объекты для экспорта отсутствуют.");
	КонецЕсли;

	Пока ВыборкаРейс.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДокументСсылка");
		
		//Атрибуты рейса
		//Номер рейса
		ЗаписьXML.ЗаписатьНачалоАтрибута("НомерРейса");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаРейс.НомерРейса));              
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//Дата рейса
		ЗаписьXML.ЗаписатьНачалоАтрибута("ДатаРейса");
		ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаРейс.ДатаРейса,"ДФ=""ггггММддЧЧммсс"""));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//ДатаНачалаРейса
		ЗаписьXML.ЗаписатьНачалоАтрибута("ДатаНачалаРейса");
		ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаРейс.ДатаНачалаРейса,"ДФ=""ггггММддЧЧммсс"""));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//Транспорт
		ЗаписьXML.ЗаписатьНачалоАтрибута("Транспорт");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаРейс.Транспорт.Код));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//Марка
		ЗаписьXML.ЗаписатьНачалоАтрибута("Марка");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(?(ЗначениеЗаполнено(ВыборкаРейс.Транспорт.Марка),ВыборкаРейс.Транспорт.Марка.Наименование,"")));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//Гос номер
		ЗаписьXML.ЗаписатьНачалоАтрибута("ГосНомер");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаРейс.Транспорт.НомерГосударственнойРегистрации));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//Водитель
		ЗаписьXML.ЗаписатьНачалоАтрибута("Водитель");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаРейс.Водитель.Код));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//Табельный номер
		ЗаписьXML.ЗаписатьНачалоАтрибута("ТабельныйНомер");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаРейс.Водитель.ТабельныйНомер));
		ЗаписьXML.ЗаписатьКонецАтрибута();
		
		//Данные для печати ТТН из КИС
		ЗаписьXML.ЗаписатьНачалоАтрибута("ДанныеДляПечатиТТН");
		ДанныеДляПечатиТТН = 	ВыборкаРейс.Транспорт.Марка.Наименование + ";" +
								ВыборкаРейс.Транспорт.НомерГосударственнойРегистрации + ";" +
								ВыборкаРейс.Транспорт.ГаражныйНомер + ";" +
								ВыборкаРейс.Водитель.ФизЛицо.Наименование + ";" +
								ВыборкаРейс.Водитель.ТабельныйНомер + ";" +
								ВыборкаРейс.Водитель.Класс + ";" +
								ВыборкаРейс.Водитель.Наемный + ";" +
								ВыборкаРейс.Экспедитор.ФизЛицо.Наименование;								
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ДанныеДляПечатиТТН));
		ЗаписьXML.ЗаписатьКонецАтрибута();

		ВыборкаЗадания = ВыборкаРейс.Выбрать();
		ш=1;
		//Тег Табличная часть
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТабличнаяЧасть");
		//
		ЗаписьXML.ЗаписатьНачалоАтрибута("ИмяТабличнойЧасти");
		ЗаписьXML.ЗаписатьТекст("МестнаяДоставка");
		ЗаписьXML.ЗаписатьКонецАтрибута();
		//
		ЗаписьXML.ЗаписатьНачалоАтрибута("Количество");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаЗадания.Количество()));
		ЗаписьXML.ЗаписатьКонецАтрибута();
	
	    //Регистрируем сообщения
		новаОбмены.РегистрацияСобытия(РегистраторСобытий, СтатусСообщения.Информация, "Экспорт", "Экспортирован: ", ВыборкаРейс.БизнесПроцессСсылка);
		новаОбмены.УвеличитьКоличествоБП(РегистраторСобытий);

		Пока ВыборкаЗадания.Следующий() Цикл
			//Тег Строка
			ЗаписьXML.ЗаписатьНачалоЭлемента("Строка");
			
			//КодСинхронизации
			ЗаписьXML.ЗаписатьНачалоАтрибута("КодСинхронизации");
			ЗаписьXML.ЗаписатьТекст("Продажа;"+Формат(ВыборкаЗадания.ДатаЗаказа,"ДФ=""ггггММддЧЧммсс""")+";"+СОКРЛП(XMLСтрока(ВыборкаЗадания.НомерЗаказа)));
			ЗаписьXML.ЗаписатьКонецАтрибута();
			//ДатаЗаявкиКИС
			ЗаписьXML.ЗаписатьНачалоАтрибута("ДатаЗаявкиКИС");
			ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаЗадания.ДатаЗаказа,"ДФ=""ггггММддЧЧммсс"""));
			ЗаписьXML.ЗаписатьКонецАтрибута();
			
			//НомерЗаявкиКИС
			ЗаписьXML.ЗаписатьНачалоАтрибута("НомерЗаявкиКИС");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаЗадания.НомерЗаказа));
			ЗаписьXML.ЗаписатьКонецАтрибута();
	
			//ВидОперации
			ЗаписьXML.ЗаписатьНачалоАтрибута("ВидОперации");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока("Продажа"));
			ЗаписьXML.ЗаписатьКонецАтрибута();
			
			//ПорядокПогрузкиВТС
			ЗаписьXML.ЗаписатьНачалоАтрибута("ПорядокПогрузкиВТС");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаЗадания.ПорядокПогрузкиВТС));
			ЗаписьXML.ЗаписатьКонецАтрибута();

			ЗаписьXML.ЗаписатьКонецЭлемента(); //Тег Строка
			ш=ш+1;
		
			новаОбмены.РегистрацияСобытия(РегистраторСобытий, СтатусСообщения.Информация, "Экспорт", "Экспортирован: ", ВыборкаЗадания.ДоставкаСсылка);
			//новаОбмены.УвеличитьКоличествоБП(РегистраторСобытий);
		КонецЦикла;
		
		//Табличная часть  
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Тег Табличная часть
		
		//Документ 
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Тег ДокументСсылка
	
		//Пишем в регистр отметку о том, что объект выгружен
		Отбор = Новый Структура("Объект");
		Отбор.Объект =  ВыборкаРейс.БизнесПроцессСсылка;
		регСостояния = РегистрыСведений.новаСостоянияОбъектовДляОбмена;
		менИзменения = Неопределено;
		выбИзменения = регСостояния.Выбрать(Отбор);
		Если выбИзменения.Следующий() Тогда
			менИзменения = выбИзменения.ПолучитьМенеджерЗаписи();
			менИзменения.Состояние = Перечисления.новаСостоянияОбъектовДляОбмена.Выгружен;
			менИзменения.Записать();
		КонецЕсли;

	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Тег Документ
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ФАЙЛОМ ОБМЕНА

// Сохраняет в файл указанный xml-узел
//
// Параметры:
//  Узел           - xml-узел, сохраняемый в файл
//
Процедура ЗаписатьВФайл(Узел) Экспорт
	
КонецПроцедуры // ЗаписатьВФайл()

Процедура ПолучитьСтруктуруРейса() Экспорт
	СтруктураРейса = Новый Структура;
	СтруктураРейса.Вставить("ИмяДокумента", "Рейс");
	СтруктураРейса.Вставить("ТипДокумента", БизнесПроцессы.новаРейсМестнойДоставки.ПустаяСсылка());
	СтруктураРейса.Вставить("СтрокаПоиска", БизнесПроцессы.новаРейсМестнойДоставки.НайтиПоРеквизиту());
 КонецПроцедуры
